---
kind: method
id: M:Autodesk.Revit.DB.RevitLinkType.GetLinkedFileStatus
source: html/796710c2-4c58-af44-affa-eab4f985b5f3.htm
---
# Autodesk.Revit.DB.RevitLinkType.GetLinkedFileStatus Method

Returns the LinkedFileStatus of this link.

## Syntax (C#)
```csharp
public LinkedFileStatus GetLinkedFileStatus()
```